import React from 'react';

const Blog = () => {
    return (
        <div className='mt-5'>
            <div className='mb-7'>
            <h2 className='text-3xl text-center font-bold text-secondary'>My Activities</h2>
            <div className='bg-secondary w-44 h-0.5 mx-auto' data-aos="fade-right" data-aos-duration="3000"></div>
            </div>

            <div className='grid lg:grid-cols-2 md:grid-cols-2 sm:grid-cols-1'>
            <di v class="collapse rounded-lg border-4">
  <input type="checkbox" class="peer" /> 
  <div class="collapse-title bg-primary text-primary-content peer-checked:bg-secondary peer-checked:text-black-content text-xl">
  সমাজ সাহিত্যে রমণী
  </div>
  <div class="collapse-content bg-slate-300"> 
  <p class="text-gray-700 text-base">
    আমাদের রচিত সমাজ রক্ষিত, শৃঙ্খলিত, সুবর্ণময়।<br />
    কে করেছে এ সমাজকে অলিখিত , অসহায়?<br />
    বহু বছরের, বহু সাধকের, বহু সভ্য সভ্যতা রচনায়,<br />
    এ সমাজের রমনীর হয়ে, লিখেছেন কত গদ্য আর কবিতায়।<br />
    এই সভ্য সমাজে কিছু রমণীর, নিজ জ্ঞানের অভাবে,<br />
    সমাজকে আজ রচিত করেছে, নিজ নিজ বহু স্বভাবে।<br />
    বহু সাধক আর ধর্মগ্রন্থে রমণীর মহা সন্মান,<br />
    রমণীরা আজ এই সন্মান, নিজ হাতে দিচ্ছে বলিদান।<br />
    তবে কি নজরুল এমনি এমনি, নারীকে দিয়েছে আকাশচুম্বী মান,<br />
    তবে কিছু নারী কেন পারেনা রাখতে, সুস্থতা আর মায়ায় জড়ানো জীবন।<br />
    সব রমণী সভ্য সমাজে দেয় না যপে মান,<br />
    কিছু সংখ্যার বদলে, গতিহিন হয় সভ্য সমাজ আর বেঙ্গে হয় খানখান।<br />
    ঐ সংখ্যা নিজেই যপে, নিজের মান গতিফের হয়ে,<br />
    আবার তারাই এসে তবে, বিচার চেয়ে বলে বেড়ায়, এ সমাজ আজ সভ্য নয়।<br />
    এ দোষারোপ কেন আজ নিবে সমাজ নিজের বক্ষে,<br />
    কেন আজ সংখ্যা ভারি হয় না, এই সমাজের পক্ষে।<br />
    আমি আছি ভাই তুমি আছো ভাই আছে আর শত পক্ষ,<br />
    কেন আজ আমরা দুয়ার খুলি না, বেধে রাখি নিজ কক্ষ।<br />
    তাহলে আজ যুগের তালে সভ্য সমাজ বদলে যাবে ক্ষণে,<br />
    এতটুকু দয়া নেই কি আমাদের বক্ষে, সমাজের সনে।<br />
    শ্রদ্ধা করি সকল নারীকে, মায়ের জাত বলে ভাই কথা,<br />
    কিছু সংখ্যক যখন এসে সভ্য সমাজ পাল্টে দিতে চায়,<br />
    তখনি মনটা হাহাকার করে আর লাগে মনে ব্যাথা।<br />
    কি বলিতে চাই, মনে কথা নাই,<br />
    এ সমাজে আজ অসুখের বড়াই।<br />
    কিছু ভালো আর খারাপের মাঝে পরে আছে আজ সমাজ সাহিত্য,<br />
    উগ্রতা আর অনিয়মে, আছে কি এই, সমাজের কোনো মহত্ত্ব!<br />
    উগ্র রমণী যেদিন ফিরবে ভদ্র সমাজ সাহিত্যে,<br />
    সেদিনই সমাজ চলবে নিজের একাগ্রতা আর মহত্তে।<br />
    আমাদের সমাজে ভদ্রতা ভরা, আর ভরা আছে শালীনতা,<br />
    আমরা ভদ্র জাতি, ভদ্র সমাজ তাতে নেই কোন দ্বিধা,<br />
    শুধু আছে ভরা মলিনতা।  
    </p>
    <div class="px-6 pt-4 pb-2">
    <span class="inline-block bg-gray-200 rounded-full px-3 py-1 text-sm font-semibold text-gray-700 mr-2 mb-2">আব্দুল্লাহ আল ওমর</span>
  </div>
  </div>
          </di>
            <div class="collapse rounded-lg border-4">
  <input type="checkbox" class="peer" /> 
  <div class="collapse-title bg-primary text-primary-content peer-checked:bg-secondary peer-checked:text-black-content text-xl">
  অবাক বিকেল
  </div>
  <div class="collapse-content bg-slate-300"> 
  <p class="text-gray-700 text-base">
    গড়িয়ে যায় সকাল দুপুর রোদ, আসে এক অবাক বিকেল।<br />
    নেই রোদ, নাতো সকাল, নাতো দুপুর, এ এক অন্য বেলা,<br />
    যখন সবার মনের ভিতর ভেসে বেরায় এক, অচেনা সুখের ভেলা।<br />
    কেউবা আবার সুখের চেতনা মনে পুষে নিয়ে বলে,<br />
    কি যে করি আজ এই অবাক বিকেলে?<br />
    পৃথিবী মেতে থাকে এক অন্য আনন্দে,<br />
    নিজেকে নিজেই বলে, এই আনন্দ নিয়ে ঘুরছি আমি নির্বাক ছন্দে।<br />
    অচেনা পাখিরা বলে, উড়ে যাবো আজ অনেক দূরে,<br />
    উড়তে উড়তে হয়ে যাবো এক অবাক ভবগুরে।<br />
    বিশাল আকাশ চেয়ে দেখে আজ তার ছায়ায় ঘুরছে অবাক জগত,<br />
    অবাক বিকেল বলে আমি আছি বেশ,<br />
    আমার সাথে কবু নাইতো কারো বিরোধ।<br />
    দুঃখ বিলাসে কারো সাথি হয়ে আছি তবু চিরদিন,<br />
    কারো সুখে আমি দূরে যাইনি তো, নিজেকে করেছি বিলীন।<br />
    অবাক বিকেল পাওয়ার জন্য সবাই করে অপেক্ষা,<br />
    অবাক বিকেল ঠিক সময়ে আসে, সবকিছু করে উপেক্ষা।<br />
    বহু প্রানের স্পন্দন নিয়ে বয়ে চলে এই বিকেলে,<br />
    সত্য মিথ্যা না চিনে বাঁধা পরে নিজস্ব গতির শিকলে।<br />
    আধার আলোর মিশ্রিত ভাব নিয়ে স্তব্দতা হাকিয়ে থাকে উদাস হয়ে,<br />
    পক্ষীরাজের চিৎকারে ঊর্ধ্ব গগন বিলীন হইয়ে থাকে তার গায়ে।<br />
    মনের আকুলতা ছড়িয়ে পরে নিজস্ব চেতনায়,<br />
    অবাক হয়ে থাকতে হবে কি সকল আকুলতায়?<br />
    গাছের চাহনিতে নিরব হয়ে ভেসে বেরায় মনের চাওয়া,<br />
    বিকেল দেখে অবাক হয়ে তার শেষ হয়ে যাওয়া। <br />
    যেমন আসে যায় রাত দুপুর আর সকাল,<br />
    তেমনি হাওয়ার সৌরভে আসে এক অবাক বিকেল।
    </p>
    <div class="px-6 pt-4 pb-2">
    <span class="inline-block bg-gray-200 rounded-full px-3 py-1 text-sm font-semibold text-gray-700 mr-2 mb-2">আব্দুল্লাহ আল ওমর</span>
  </div>
  </div>
          </div>
            <div class="collapse rounded-lg border-4">
  <input type="checkbox" class="peer" /> 
  <div class="collapse-title bg-primary text-primary-content peer-checked:bg-secondary peer-checked:text-black-content text-xl">
  ধর্ষণে প্রতিবাদ
  </div>
  <div class="collapse-content bg-slate-300"> 
  <p class="text-gray-700 text-base">
    আমরা সবাই মানুষ হয়ে এসেছি এ পৃথিবীতে,<br />
    ভেদাভেদ হয়ে গিয়েছে মানুষ নিজ নিজ কত রুচিতে,<br />
    ভালো খারাপের মধ্যে আমরা বেচে আছি সবে যুগে,<br />
    কেউবা খারাপে আবার ভালোয় মজবে কোনো এক সুযোগে।<br />
    এ সমাজে আছে পুরুষ নারী একসাথে মিলে সবে,<br />
    কারো প্রতি কারো আছে সন্মান আবার নেই কারো স্বভাবে।<br />
    কিছু পুরুষের কার্য কলাপ কুরুচিকে মানায় হার,<br />
    এরা তারা যারা করেনা সম্নান,লজ্জাও নেই যার।<br />
    লজ্জিত তারা হয় না কখনো,বরং করে কলঙ্কিত,<br />
    ওদের মুখে বিষ্ঠা ছুরে মারো,যারা হয় না লজ্জিত।<br />
    নারীকে করেনা সন্মান,নেই কোনো মনঃক্ষুণ্ণতা,<br />
    ওদের জন্য নারীরা আজ পায়না কখনো পুর্নতা।<br />
    ওরা বেজন্মা ওরা পিচাশ,ওরা অসাধুর রাজা,<br />
    কে আছিস তোরা ওদের এসে দে আছে যত সাজা।<br />
    ওরা ধর্ষক ওরা অমানুষ, ওদের করো নিধন,<br />
    ওদের পিঠে বসাও আঘাত, শেষ করে দাও প্রান।<br />
    ওরা নারীদের প্রতি করে অবহেলা, করে নির্যাতন,<br />
    ওদের গলায় দড়ি পরিয়ে ঝুলাও ইচ্ছা মতন।<br />
    যেখানেই পাবে ধর্ষকের খোজ,যেখানে ওদের দেখা,<br />
    সেখানেই করে দেবে ওর লিঙ্গভেদ,<br />
    পূরন হতে দেবে না আরে ওর কোনো আকাঙ্ক্ষা।<br />
    দর্ষকমুক্ত করতে হবে আমাদের স্বাধীন দেশকে,<br />
    দেশ বাচবে, সমাজ বাচবে দেখে নিবো এর শেষকে।<br />
    এ আমার দেশ,এ আমার সমাজ,এ আমার বঙ্গভূমি,<br />
    আমরা আছি বোন তোমার সাথে,এসো এগিয়ে তুমি।
  
    </p>
    <div class="px-6 pt-4 pb-2">
    <span class="inline-block bg-gray-200 rounded-full px-3 py-1 text-sm font-semibold text-gray-700 mr-2 mb-2">আব্দুল্লাহ আল ওমর</span>
  </div>
  </div>
          </div>
            <div class="collapse rounded-lg border-4">
  <input type="checkbox" class="peer" /> 
  <div class="collapse-title bg-primary text-primary-content peer-checked:bg-secondary peer-checked:text-black-content text-xl">
  বঙ্গবন্ধু
  </div>
  <div class="collapse-content bg-slate-300"> 
  <p class="text-gray-700 text-base">
    ১৯২০ এর ১৭ মার্চ জন্ম নিয়েছিলো এক বালক,<br />
    যেমন ছিলো দরদ তেমনই সাহস,<br />
    ছিলো তখন তার অল্প বয়স।<br />
    নিজের মনের ভেরত থেকে ভালোবাসতেন মানুষকে,<br />
    মনের মাধুরী দিয়ে বুঝাতেন অবুঝকে।<br />
    সততা আর সাহস নিয়ে মানুষের পাশে দাড়াতেন,<br />
    দরিদ্রের দুঃখ দিনে হাত দুটি তিনি বাড়াতেন।<br />
    সবার মনে জায়গা করে তখনি নিয়েছেন তিনি,<br />
    সবার মনের কষ্টগুলো বুঝতে পেরেছেন যিনি।<br />
    দেশটি ছিলো অন্যের অধিন,<br />
    কে আনবে ডেকে স্বাধীন?<br />
    সব মানুষ ভয়ে ছিলো বাকহারা হয়ে ঘরে,<br />
    হতাস হতো যখনি দেখতো,<br />
    দরজার কড়া নরে।<br />
    বাংলা ভাষা দেবে না বলে পাকিস্তানি হানাদার,<br />
    মেরেছে মোদের অনেক ভাইকে, মায়েরা করেছে হাহাকার।<br />
    ৭ই মার্চে মুজিব দিয়েছে রক্তগরম ভাষন,<br />
    বাঙালি তখন সপৎ করেছে শেষ করবে পাকদের স্বাশন।<br />
    যার কথা শুনে মনবল পেলো বাঙালি সাহসি যুবক,<br />
    তারই হাত ধরে আনলো তারা বাংলা ভাষার 'বাক'।<br />
    দেশ গঠনের নিতিই নায়ক তিনিই একটি প্রান,<br />
    স্যালুট জানাই যারা দিয়েছেন দেশের জন্য জান।<br />
    তারই হাত ধরে পেয়েছি এ দেশ, আরো পেয়েছি বাংলা ভাষা।<br />
    পেয়েছি স্বাধিন দেশের সাথে একরাশ সুখের আশা।<br />
    এ দেশের জন্য দামাল ছেলেরা,<br />
    রক্ত দিয়েছে বিন্দুর পর বিন্দু,<br />
    স্বাধিনতা পেতে সাহস দিয়েছে যিনি,<br />
    তিনিই আমাদের জাতির অহংকার,<br />
    তিনিই 'বঙ্গবন্ধু'।

    </p>
    <div class="px-6 pt-4 pb-2">
    <span class="inline-block bg-gray-200 rounded-full px-3 py-1 text-sm font-semibold text-gray-700 mr-2 mb-2">আব্দুল্লাহ আল ওমর</span>
  </div>
  </div>
          </div>
          </div>
        </div>
    );
};

export default Blog;